In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("salary_data.csv")
clean_df = df.copy()
df.head()

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
0,32.0,Male,Bachelor's,Software Engineer,5.0,90000.0
1,28.0,Female,Master's,Data Analyst,3.0,65000.0
2,45.0,Male,PhD,Senior Manager,15.0,150000.0
3,36.0,Female,Bachelor's,Sales Associate,7.0,60000.0
4,52.0,Male,Master's,Director,20.0,200000.0

In [3]:
clean_df['Age'] = df['Age'].fillna(int(df['Age'].mean()))
clean_df['Years of Experience'] = df['Years of Experience'].fillna(int(df['Years of Experience'].mean()))
clean_df['Salary'] = df['Salary'].fillna(int(df['Salary'].mean()))
clean_df['Gender'] = df['Gender'].fillna(df['Gender'].mode()[0])
clean_df['Education Level'] = df['Education Level'].fillna(df['Education Level'].mode()[0])
clean_df['Job Title'] = df['Job Title'].fillna(df['Job Title'].mode()[0])
clean_df.isna().sum()

Age                    0
Gender                 0
Education Level        0
Job Title              0
Years of Experience    0
Salary                 0
dtype: int64

In [4]:
clean_df.loc[clean_df['Education Level'] == "phD", 'Education Level'] = "PhD"
clean_df.loc[clean_df['Education Level'] == "Bachelor's Degree", 'Education Level'] = "Bachelor's"
clean_df.loc[clean_df['Education Level'] == "Master's Degree", 'Education Level'] = "Master's"

In [5]:
clean_df.to_csv("clean_data.csv", index=False)
clean_df.head()

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
0,32.0,Male,Bachelor's,Software Engineer,5.0,90000.0
1,28.0,Female,Master's,Data Analyst,3.0,65000.0
2,45.0,Male,PhD,Senior Manager,15.0,150000.0
3,36.0,Female,Bachelor's,Sales Associate,7.0,60000.0
4,52.0,Male,Master's,Director,20.0,200000.0